advancedwebdeveloper/rv32m1_sdk_riscv/boards/rv32m1_vega/wireless_examples/bluetooth/running_scs/bm/zero_riscy/pin_mux.h
/*
 * Copyright 2017 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins_ri5cy(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins_cm4(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins_zero_riscy(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins_cm0p(void);

/* PORTA0 (coord B10), BUTTON_NMI */
#define BOARD_INITBUTTONS_SW2_GPIO                                         GPIOA   /*!< GPIO device name: GPIOA */
#define BOARD_INITBUTTONS_SW2_PORT                                         PORTA   /*!< PORT device name: PORTA */
#define BOARD_INITBUTTONS_SW2_GPIO_PIN                                        0U   /*!< PORTA pin index: 0 */
#define BOARD_INITBUTTONS_SW2_PIN_NAME                                      PTA0   /*!< Pin name */
#define BOARD_INITBUTTONS_SW2_LABEL                                 "BUTTON_NMI"   /*!< Label */
#define BOARD_INITBUTTONS_SW2_NAME                                         "SW2"   /*!< Identifier name */
#define BOARD_INITBUTTONS_SW2_DIRECTION                  kPIN_MUX_DirectionInput   /*!< Direction */

/* PORTE8 (coord P16), BUTTON_LLWUP23 */
#define BOARD_INITBUTTONS_SW3_GPIO                                         GPIOE   /*!< GPIO device name: GPIOE */
#define BOARD_INITBUTTONS_SW3_PORT                                         PORTE   /*!< PORT device name: PORTE */
#define BOARD_INITBUTTONS_SW3_GPIO_PIN                                        8U   /*!< PORTE pin index: 8 */
#define BOARD_INITBUTTONS_SW3_PIN_NAME                                      PTE8   /*!< Pin name */
#define BOARD_INITBUTTONS_SW3_LABEL                             "BUTTON_LLWUP23"   /*!< Label */
#define BOARD_INITBUTTONS_SW3_NAME                                         "SW3"   /*!< Identifier name */
#define BOARD_INITBUTTONS_SW3_DIRECTION                  kPIN_MUX_DirectionInput   /*!< Direction */

/* PORTE9 (coord N16), BUTTON_LLWUP24 */
#define BOARD_INITBUTTONS_SW4_GPIO                                         GPIOE   /*!< GPIO device name: GPIOE */
#define BOARD_INITBUTTONS_SW4_PORT                                         PORTE   /*!< PORT device name: PORTE */
#define BOARD_INITBUTTONS_SW4_GPIO_PIN                                        9U   /*!< PORTE pin index: 9 */
#define BOARD_INITBUTTONS_SW4_PIN_NAME                                      PTE9   /*!< Pin name */
#define BOARD_INITBUTTONS_SW4_LABEL                             "BUTTON_LLWUP24"   /*!< Label */
#define BOARD_INITBUTTONS_SW4_NAME                                         "SW4"   /*!< Identifier name */
#define BOARD_INITBUTTONS_SW4_DIRECTION                  kPIN_MUX_DirectionInput   /*!< Direction */

/* PORTE12 (coord L12), BUTTON_LLWUP26 */
#define BOARD_INITBUTTONS_SW5_GPIO                                         GPIOE   /*!< GPIO device name: GPIOE */
#define BOARD_INITBUTTONS_SW5_PORT                                         PORTE   /*!< PORT device name: PORTE */
#define BOARD_INITBUTTONS_SW5_GPIO_PIN                                       12U   /*!< PORTE pin index: 12 */
#define BOARD_INITBUTTONS_SW5_PIN_NAME                                     PTE12   /*!< Pin name */
#define BOARD_INITBUTTONS_SW5_LABEL                             "BUTTON_LLWUP26"   /*!< Label */
#define BOARD_INITBUTTONS_SW5_NAME                                         "SW5"   /*!< Identifier name */
#define BOARD_INITBUTTONS_SW5_DIRECTION                  kPIN_MUX_DirectionInput   /*!< Direction */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitButtons(void);

/* PORTA22 (coord B6), Q6[2]/LED_BLUE */
#define BOARD_INITLEDS_RGB_BLUE_GPIO                                       GPIOA   /*!< GPIO device name: GPIOA */
#define BOARD_INITLEDS_RGB_BLUE_PORT                                       PORTA   /*!< PORT device name: PORTA */
#define BOARD_INITLEDS_RGB_BLUE_GPIO_PIN                                     22U   /*!< PORTA pin index: 22 */
#define BOARD_INITLEDS_RGB_BLUE_PIN_NAME                                   PTA22   /*!< Pin name */
#define BOARD_INITLEDS_RGB_BLUE_LABEL                           "Q6[2]/LED_BLUE"   /*!< Label */
#define BOARD_INITLEDS_RGB_BLUE_NAME                                  "RGB_BLUE"   /*!< Identifier name */
#define BOARD_INITLEDS_RGB_BLUE_DIRECTION               kPIN_MUX_DirectionOutput   /*!< Direction */

/* PORTA23 (coord E6), Q7[5]/LED_GREEN */
#define BOARD_INITLEDS_RGB_GREEN_GPIO                                      GPIOA   /*!< GPIO device name: GPIOA */
#define BOARD_INITLEDS_RGB_GREEN_PORT                                      PORTA   /*!< PORT device name: PORTA */
#define BOARD_INITLEDS_RGB_GREEN_GPIO_PIN                                    23U   /*!< PORTA pin index: 23 */
#define BOARD_INITLEDS_RGB_GREEN_PIN_NAME                                  PTA23   /*!< Pin name */
#define BOARD_INITLEDS_RGB_GREEN_LABEL                         "Q7[5]/LED_GREEN"   /*!< Label */
#define BOARD_INITLEDS_RGB_GREEN_NAME                                "RGB_GREEN"   /*!< Identifier name */
#define BOARD_INITLEDS_RGB_GREEN_DIRECTION              kPIN_MUX_DirectionOutput   /*!< Direction */

/* PORTA24 (coord D6), Q7[2]/LED_RED */
#define BOARD_INITLEDS_RGB_RED_GPIO                                        GPIOA   /*!< GPIO device name: GPIOA */
#define BOARD_INITLEDS_RGB_RED_PORT                                        PORTA   /*!< PORT device name: PORTA */
#define BOARD_INITLEDS_RGB_RED_GPIO_PIN                                      24U   /*!< PORTA pin index: 24 */
#define BOARD_INITLEDS_RGB_RED_PIN_NAME                                    PTA24   /*!< Pin name */
#define BOARD_INITLEDS_RGB_RED_LABEL                             "Q7[2]/LED_RED"   /*!< Label */
#define BOARD_INITLEDS_RGB_RED_NAME                                    "RGB_RED"   /*!< Identifier name */
#define BOARD_INITLEDS_RGB_RED_DIRECTION                kPIN_MUX_DirectionOutput   /*!< Direction */

