advancedwebdeveloper/rv32m1_sdk_riscv/boards/rv32m1_vega/wireless_examples/bluetooth/running_scs/bm/zero_riscy/pin_mux.h
/* PORTE0 (coord R14), LED_STS */
#define BOARD_INITLEDS_LED_STS_GPIO                                        GPIOE   /*!< GPIO device name: GPIOE */
#define BOARD_INITLEDS_LED_STS_PORT                                        PORTE   /*!< PORT device name: PORTE */
#define BOARD_INITLEDS_LED_STS_GPIO_PIN                                       0U   /*!< PORTE pin index: 0 */
#define BOARD_INITLEDS_LED_STS_PIN_NAME                                     PTE0   /*!< Pin name */
#define BOARD_INITLEDS_LED_STS_LABEL                                   "LED_STS"   /*!< Label */
#define BOARD_INITLEDS_LED_STS_NAME                                    "LED_STS"   /*!< Identifier name */
#define BOARD_INITLEDS_LED_STS_DIRECTION                kPIN_MUX_DirectionOutput   /*!< Direction */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLEDs(void);

/* PORTC7 (coord N2), U40[1]/RV32M1_UART0_RX */
#define BOARD_INITLPUART_DEBUG_UART0_RX_PERIPHERAL                       LPUART0   /*!< Device name: LPUART0 */
#define BOARD_INITLPUART_DEBUG_UART0_RX_SIGNAL                                RX   /*!< LPUART0 signal: RX */
#define BOARD_INITLPUART_DEBUG_UART0_RX_PIN_NAME                      LPUART0_RX   /*!< Pin name */
#define BOARD_INITLPUART_DEBUG_UART0_RX_LABEL             "U40[1]/RV32M1_UART0_RX"   /*!< Label */
#define BOARD_INITLPUART_DEBUG_UART0_RX_NAME                    "DEBUG_UART0_RX"   /*!< Identifier name */

/* PORTC8 (coord P3), U11[1]/RV32M1_UART0_TX */
#define BOARD_INITLPUART_DEBUG_UART0_TX_PERIPHERAL                       LPUART0   /*!< Device name: LPUART0 */
#define BOARD_INITLPUART_DEBUG_UART0_TX_SIGNAL                                TX   /*!< LPUART0 signal: TX */
#define BOARD_INITLPUART_DEBUG_UART0_TX_PIN_NAME                      LPUART0_TX   /*!< Pin name */
#define BOARD_INITLPUART_DEBUG_UART0_TX_LABEL             "U11[1]/RV32M1_UART0_TX"   /*!< Label */
#define BOARD_INITLPUART_DEBUG_UART0_TX_NAME                    "DEBUG_UART0_TX"   /*!< Identifier name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLPUART(void);

/* EXTAL32 (coord E16), Y1[1]/EXTAL_32KHZ */
#define BOARD_INITOSC_EXTAL32_PERIPHERAL                                     RTC   /*!< Device name: RTC */
#define BOARD_INITOSC_EXTAL32_SIGNAL                                     EXTAL32   /*!< RTC signal: EXTAL32 */
#define BOARD_INITOSC_EXTAL32_PIN_NAME                                   EXTAL32   /*!< Pin name */
#define BOARD_INITOSC_EXTAL32_LABEL                          "Y1[1]/EXTAL_32KHZ"   /*!< Label */
#define BOARD_INITOSC_EXTAL32_NAME                                     "EXTAL32"   /*!< Identifier name */

/* XTAL32 (coord E17), Y1[2]/XTAL_32KHZ */
#define BOARD_INITOSC_XTAL32_PERIPHERAL                                      RTC   /*!< Device name: RTC */
#define BOARD_INITOSC_XTAL32_SIGNAL                                       XTAL32   /*!< RTC signal: XTAL32 */
#define BOARD_INITOSC_XTAL32_PIN_NAME                                     XTAL32   /*!< Pin name */
#define BOARD_INITOSC_XTAL32_LABEL                            "Y1[2]/XTAL_32KHZ"   /*!< Label */
#define BOARD_INITOSC_XTAL32_NAME                                       "XTAL32"   /*!< Identifier name */

/* XTAL_RF (coord A11), Y3[1]/XTAL_32M */
#define BOARD_INITOSC_XTAL_RF_PERIPHERAL                                     RF0   /*!< Device name: RF0 */
#define BOARD_INITOSC_XTAL_RF_SIGNAL                                     XTAL_RF   /*!< RF0 signal: XTAL_RF */
#define BOARD_INITOSC_XTAL_RF_PIN_NAME                                   XTAL_RF   /*!< Pin name */
#define BOARD_INITOSC_XTAL_RF_LABEL                             "Y3[1]/XTAL_32M"   /*!< Label */
#define BOARD_INITOSC_XTAL_RF_NAME                                     "XTAL_RF"   /*!< Identifier name */

/* EXTAL_RF (coord B11), Y3[3]/EXTAL_32M */
#define BOARD_INITOSC_EXTAL_RF_PERIPHERAL                                    RF0   /*!< Device name: RF0 */
#define BOARD_INITOSC_EXTAL_RF_SIGNAL                                   EXTAL_RF   /*!< RF0 signal: EXTAL_RF */
#define BOARD_INITOSC_EXTAL_RF_PIN_NAME                                 EXTAL_RF   /*!< Pin name */
#define BOARD_INITOSC_EXTAL_RF_LABEL                           "Y3[3]/EXTAL_32M"   /*!< Label */
#define BOARD_INITOSC_EXTAL_RF_NAME                                   "EXTAL_RF"   /*!< Identifier name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitOSC(void);

/* PORTE30 (coord G17), U14[4]/ACCEL_I2C3_SCL */
#define BOARD_INITACCEL_ACCEL_SCL_PERIPHERAL                              LPI2C3   /*!< Device name: LPI2C3 */
#define BOARD_INITACCEL_ACCEL_SCL_SIGNAL                                     SCL   /*!< LPI2C3 signal: SCL */
#define BOARD_INITACCEL_ACCEL_SCL_PIN_NAME                            LPI2C3_SCL   /*!< Pin name */
#define BOARD_INITACCEL_ACCEL_SCL_LABEL                  "U14[4]/ACCEL_I2C3_SCL"   /*!< Label */
#define BOARD_INITACCEL_ACCEL_SCL_NAME                               "ACCEL_SCL"   /*!< Identifier name */

/* PORTE29 (coord G15), U14[6]/ACCEL_I2C3_SDA */
#define BOARD_INITACCEL_ACCEL_SDA_PERIPHERAL                              LPI2C3   /*!< Device name: LPI2C3 */
#define BOARD_INITACCEL_ACCEL_SDA_SIGNAL                                     SDA   /*!< LPI2C3 signal: SDA */
#define BOARD_INITACCEL_ACCEL_SDA_PIN_NAME                            LPI2C3_SDA   /*!< Pin name */
#define BOARD_INITACCEL_ACCEL_SDA_LABEL                  "U14[6]/ACCEL_I2C3_SDA"   /*!< Label */
#define BOARD_INITACCEL_ACCEL_SDA_NAME                               "ACCEL_SDA"   /*!< Identifier name */

/* PORTE1 (coord R16), U14[11]/ACCEL_INT1 */
#define BOARD_INITACCEL_ACCEL_INT1_GPIO                                    GPIOE   /*!< GPIO device name: GPIOE */
#define BOARD_INITACCEL_ACCEL_INT1_PORT                                    PORTE   /*!< PORT device name: PORTE */
#define BOARD_INITACCEL_ACCEL_INT1_GPIO_PIN                                   1U   /*!< PORTE pin index: 1 */
#define BOARD_INITACCEL_ACCEL_INT1_PIN_NAME                                 PTE1   /*!< Pin name */
#define BOARD_INITACCEL_ACCEL_INT1_LABEL                    "U14[11]/ACCEL_INT1"   /*!< Label */
#define BOARD_INITACCEL_ACCEL_INT1_NAME                             "ACCEL_INT1"   /*!< Identifier name */
#define BOARD_INITACCEL_ACCEL_INT1_DIRECTION             kPIN_MUX_DirectionInput   /*!< Direction */

/* PORTE22 (coord J16), U14[9]/ACCEL_INT2 */
#define BOARD_INITACCEL_ACCEL_INT2_GPIO                                    GPIOE   /*!< GPIO device name: GPIOE */
#define BOARD_INITACCEL_ACCEL_INT2_PORT                                    PORTE   /*!< PORT device name: PORTE */
#define BOARD_INITACCEL_ACCEL_INT2_GPIO_PIN                                  22U   /*!< PORTE pin index: 22 */
#define BOARD_INITACCEL_ACCEL_INT2_PIN_NAME                                PTE22   /*!< Pin name */
#define BOARD_INITACCEL_ACCEL_INT2_LABEL                     "U14[9]/ACCEL_INT2"   /*!< Label */
#define BOARD_INITACCEL_ACCEL_INT2_NAME                             "ACCEL_INT2"   /*!< Identifier name */
#define BOARD_INITACCEL_ACCEL_INT2_DIRECTION             kPIN_MUX_DirectionInput   /*!< Direction */

