advancedwebdeveloper/rv32m1_sdk_riscv/boards/rv32m1_vega/wireless_examples/bluetooth/running_scs/bm/zero_riscy/pin_mux.h
/* PORTE27 (coord H14), U14[16]/ACCEL_RST */
#define BOARD_INITACCEL_ACCEL_RST_GPIO                                     GPIOE   /*!< GPIO device name: GPIOE */
#define BOARD_INITACCEL_ACCEL_RST_PORT                                     PORTE   /*!< PORT device name: PORTE */
#define BOARD_INITACCEL_ACCEL_RST_GPIO_PIN                                   27U   /*!< PORTE pin index: 27 */
#define BOARD_INITACCEL_ACCEL_RST_PIN_NAME                                 PTE27   /*!< Pin name */
#define BOARD_INITACCEL_ACCEL_RST_LABEL                      "U14[16]/ACCEL_RST"   /*!< Label */
#define BOARD_INITACCEL_ACCEL_RST_NAME                               "ACCEL_RST"   /*!< Identifier name */
#define BOARD_INITACCEL_ACCEL_RST_DIRECTION             kPIN_MUX_DirectionOutput   /*!< Direction */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitACCEL(void);

/* PORTB9 (coord F4), J4[6]/J47[2]/ARDUINO_A2/ADC0_SE3 */
#define BOARD_INITLIGHT_SENSOR_SNS_LIGHT_ADC_GPIO                          GPIOB   /*!< GPIO device name: GPIOB */
#define BOARD_INITLIGHT_SENSOR_SNS_LIGHT_ADC_PORT                          PORTB   /*!< PORT device name: PORTB */
#define BOARD_INITLIGHT_SENSOR_SNS_LIGHT_ADC_GPIO_PIN                         9U   /*!< PORTB pin index: 9 */
#define BOARD_INITLIGHT_SENSOR_SNS_LIGHT_ADC_PIN_NAME                       PTB9   /*!< Pin name */
#define BOARD_INITLIGHT_SENSOR_SNS_LIGHT_ADC_LABEL "J4[6]/J47[2]/ARDUINO_A2/ADC0_SE3" /*!< Label */
#define BOARD_INITLIGHT_SENSOR_SNS_LIGHT_ADC_NAME                "SNS_LIGHT_ADC"   /*!< Identifier name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLIGHT_SENSOR(void);

/* USB0_DM (coord T12), J8[2]/RV32M1_USB_DN */
#define BOARD_INITUSB_USB0_DM_PERIPHERAL                                    USB0   /*!< Device name: USB0 */
#define BOARD_INITUSB_USB0_DM_SIGNAL                                          DM   /*!< USB0 signal: DM */
#define BOARD_INITUSB_USB0_DM_PIN_NAME                                   USB0_DM   /*!< Pin name */
#define BOARD_INITUSB_USB0_DM_LABEL                          "J8[2]/RV32M1_USB_DN"   /*!< Label */
#define BOARD_INITUSB_USB0_DM_NAME                                     "USB0_DM"   /*!< Identifier name */

/* USB0_DP (coord T11), J8[3]/RV32M1_USB_DP */
#define BOARD_INITUSB_USB0_DP_PERIPHERAL                                    USB0   /*!< Device name: USB0 */
#define BOARD_INITUSB_USB0_DP_SIGNAL                                          DP   /*!< USB0 signal: DP */
#define BOARD_INITUSB_USB0_DP_PIN_NAME                                   USB0_DP   /*!< Pin name */
#define BOARD_INITUSB_USB0_DP_LABEL                          "J8[3]/RV32M1_USB_DP"   /*!< Label */
#define BOARD_INITUSB_USB0_DP_NAME                                     "USB0_DP"   /*!< Identifier name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUSB(void);

/* PORTD11 (coord R11), J9[P1]/SDHC0_D2 */
#define BOARD_INITSDHC_SDHC0_D2_PERIPHERAL                                 SDHC0   /*!< Device name: SDHC0 */
#define BOARD_INITSDHC_SDHC0_D2_SIGNAL                                      DATA   /*!< SDHC0 signal: DATA */
#define BOARD_INITSDHC_SDHC0_D2_CHANNEL                                        2   /*!< SDHC0 DATA channel: 2 */
#define BOARD_INITSDHC_SDHC0_D2_PIN_NAME                                SDHC0_D2   /*!< Pin name */
#define BOARD_INITSDHC_SDHC0_D2_LABEL                          "J9[P1]/SDHC0_D2"   /*!< Label */
#define BOARD_INITSDHC_SDHC0_D2_NAME                                  "SDHC0_D2"   /*!< Identifier name */

/* PORTD10 (coord P11), J9[P2]/SDHC0_D3 */
#define BOARD_INITSDHC_SDHC0_D3_PERIPHERAL                                 SDHC0   /*!< Device name: SDHC0 */
#define BOARD_INITSDHC_SDHC0_D3_SIGNAL                                      DATA   /*!< SDHC0 signal: DATA */
#define BOARD_INITSDHC_SDHC0_D3_CHANNEL                                        3   /*!< SDHC0 DATA channel: 3 */
#define BOARD_INITSDHC_SDHC0_D3_PIN_NAME                                SDHC0_D3   /*!< Pin name */
#define BOARD_INITSDHC_SDHC0_D3_LABEL                          "J9[P2]/SDHC0_D3"   /*!< Label */
#define BOARD_INITSDHC_SDHC0_D3_NAME                                  "SDHC0_D3"   /*!< Identifier name */

/* PORTD9 (coord U11), J9[P3]/SDHC0_CMD */
#define BOARD_INITSDHC_SDHC0_CMD_PERIPHERAL                                SDHC0   /*!< Device name: SDHC0 */
#define BOARD_INITSDHC_SDHC0_CMD_SIGNAL                                      CMD   /*!< SDHC0 signal: CMD */
#define BOARD_INITSDHC_SDHC0_CMD_PIN_NAME                              SDHC0_CMD   /*!< Pin name */
#define BOARD_INITSDHC_SDHC0_CMD_LABEL                        "J9[P3]/SDHC0_CMD"   /*!< Label */
#define BOARD_INITSDHC_SDHC0_CMD_NAME                                "SDHC0_CMD"   /*!< Identifier name */

/* PORTD8 (coord T9), J9[P5]/SDHC0_DCLK */
#define BOARD_INITSDHC_SDHC0_DCLK_PERIPHERAL                               SDHC0   /*!< Device name: SDHC0 */
#define BOARD_INITSDHC_SDHC0_DCLK_SIGNAL                                    DCLK   /*!< SDHC0 signal: DCLK */
#define BOARD_INITSDHC_SDHC0_DCLK_PIN_NAME                            SDHC0_DCLK   /*!< Pin name */
#define BOARD_INITSDHC_SDHC0_DCLK_LABEL                      "J9[P5]/SDHC0_DCLK"   /*!< Label */
#define BOARD_INITSDHC_SDHC0_DCLK_NAME                              "SDHC0_DCLK"   /*!< Identifier name */

/* PORTD7 (coord P10), J9[P7]/SDHC0_D0 */
#define BOARD_INITSDHC_SDHC0_D0_PERIPHERAL                                 SDHC0   /*!< Device name: SDHC0 */
#define BOARD_INITSDHC_SDHC0_D0_SIGNAL                                      DATA   /*!< SDHC0 signal: DATA */
#define BOARD_INITSDHC_SDHC0_D0_CHANNEL                                        0   /*!< SDHC0 DATA channel: 0 */
#define BOARD_INITSDHC_SDHC0_D0_PIN_NAME                                SDHC0_D0   /*!< Pin name */
#define BOARD_INITSDHC_SDHC0_D0_LABEL                          "J9[P7]/SDHC0_D0"   /*!< Label */
#define BOARD_INITSDHC_SDHC0_D0_NAME                                  "SDHC0_D0"   /*!< Identifier name */

/* PORTD6 (coord U9), J9[P8]/SDHC0_D1 */
#define BOARD_INITSDHC_SDHC0_D1_PERIPHERAL                                 SDHC0   /*!< Device name: SDHC0 */
#define BOARD_INITSDHC_SDHC0_D1_SIGNAL                                      DATA   /*!< SDHC0 signal: DATA */
#define BOARD_INITSDHC_SDHC0_D1_CHANNEL                                        1   /*!< SDHC0 DATA channel: 1 */
#define BOARD_INITSDHC_SDHC0_D1_PIN_NAME                                SDHC0_D1   /*!< Pin name */
#define BOARD_INITSDHC_SDHC0_D1_LABEL                          "J9[P8]/SDHC0_D1"   /*!< Label */
#define BOARD_INITSDHC_SDHC0_D1_NAME                                  "SDHC0_D1"   /*!< Identifier name */

/* PORTC27 (coord P6), J9[G1]/SD_DETECT */
#define BOARD_INITSDHC_SD_DETECT_GPIO                                      GPIOC   /*!< GPIO device name: GPIOC */
#define BOARD_INITSDHC_SD_DETECT_PORT                                      PORTC   /*!< PORT device name: PORTC */
#define BOARD_INITSDHC_SD_DETECT_GPIO_PIN                                    27U   /*!< PORTC pin index: 27 */
#define BOARD_INITSDHC_SD_DETECT_PIN_NAME                                  PTC27   /*!< Pin name */
#define BOARD_INITSDHC_SD_DETECT_LABEL                        "J9[G1]/SD_DETECT"   /*!< Label */
#define BOARD_INITSDHC_SD_DETECT_NAME                                "SD_DETECT"   /*!< Identifier name */
#define BOARD_INITSDHC_SD_DETECT_DIRECTION               kPIN_MUX_DirectionInput   /*!< Direction */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSDHC(void);

