advancedwebdeveloper/rv32m1_sdk_riscv/boards/rv32m1_vega/wireless_examples/bluetooth/running_scs/bm/zero_riscy/pin_mux.h
/* PORTA22 (coord B6), Q6[2]/LED_BLUE */
#define BOARD_INITRGB_RGB_BLUE_PERIPHERAL                                   TPM2   /*!< Device name: TPM2 */
#define BOARD_INITRGB_RGB_BLUE_SIGNAL                                         CH   /*!< TPM2 signal: CH */
#define BOARD_INITRGB_RGB_BLUE_CHANNEL                                         2   /*!< TPM2 channel: 2 */
#define BOARD_INITRGB_RGB_BLUE_PIN_NAME                                 TPM2_CH2   /*!< Pin name */
#define BOARD_INITRGB_RGB_BLUE_LABEL                            "Q6[2]/LED_BLUE"   /*!< Label */
#define BOARD_INITRGB_RGB_BLUE_NAME                                   "RGB_BLUE"   /*!< Identifier name */

/* PORTA23 (coord E6), Q7[5]/LED_GREEN */
#define BOARD_INITRGB_RGB_GREEN_PERIPHERAL                                  TPM2   /*!< Device name: TPM2 */
#define BOARD_INITRGB_RGB_GREEN_SIGNAL                                        CH   /*!< TPM2 signal: CH */
#define BOARD_INITRGB_RGB_GREEN_CHANNEL                                        1   /*!< TPM2 channel: 1 */
#define BOARD_INITRGB_RGB_GREEN_PIN_NAME                                TPM2_CH1   /*!< Pin name */
#define BOARD_INITRGB_RGB_GREEN_LABEL                          "Q7[5]/LED_GREEN"   /*!< Label */
#define BOARD_INITRGB_RGB_GREEN_NAME                                 "RGB_GREEN"   /*!< Identifier name */

/* PORTA24 (coord D6), Q7[2]/LED_RED */
#define BOARD_INITRGB_RGB_RED_PERIPHERAL                                    TPM2   /*!< Device name: TPM2 */
#define BOARD_INITRGB_RGB_RED_SIGNAL                                          CH   /*!< TPM2 signal: CH */
#define BOARD_INITRGB_RGB_RED_CHANNEL                                          0   /*!< TPM2 channel: 0 */
#define BOARD_INITRGB_RGB_RED_PIN_NAME                                  TPM2_CH0   /*!< Pin name */
#define BOARD_INITRGB_RGB_RED_LABEL                              "Q7[2]/LED_RED"   /*!< Label */
#define BOARD_INITRGB_RGB_RED_NAME                                     "RGB_RED"   /*!< Identifier name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitRGB(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSPI(void);

void BOARD_InitI2C(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/*******************************************************************************
 * EOF
 ******************************************************************************/
